Revit 2027 API
TableCellStyle.BorderLeftLineStyle Property
 The element id (GraphicsStyle element) for the left line of the cell border.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BorderLeftLineStyle { get; set; }
Public Property BorderLeftLineStyle As ElementId
	Get
	Set
public:
property ElementId^ BorderLeftLineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BorderLeftLineStyle : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace